/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число х, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от cos(z) за всяко z в интервала [0;x) и да се запише като първи елемент в масива. Да се намери сумата от cos(z) за всяко z в интервала [x; 2x) и да се запише като втори елемент в масива. Аналогично да се намерят сумите на cos(z) за всички интервали [Nx; (N+1)x ) и да се запишат като елемент N в масива за всяко N в интервала [0, 10). Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>
#include<math.h>

int main()
{
    int x, z=0;
    float sum=0, a[10];
    int i,k;
    
    for(x=0; (x<=0)||(x>=10);) scanf("%d", &x);
    for(i=0; i<=9; i++)
    {
             for(k=i*x; k<=(i+1)*x; k++) sum+=cos(z++);
             a[i]=sum;
             sum=0;
    }
    
    for(i=0; i<=9; i++) printf("%f\n", a[i]);
    
    system("pause");
    return 0;
}
