/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число N в интервала [0; +?) делящо се на х. Да се намери сумата на всички числа в интервала [0; N] и да се запише като първи елемент в масива. Да се намери второто число N' в интервала [0; +?) делящо се на x. Да се намери сумата на всички числа в интервала [0, N'] и да се запише като втори елемент в масива. Аналогично да се запълнят и останалите елементи на масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main()
{
    int x,sum=0,n, a[10];
    int i,k,break_counter=0;
    for(x=0; (x<=0)||(x>=10);) scanf("%d", &x);
    for(i=0;;i++)
    {
                 
                 if(((float)i/x)-i/x==0)
                 {
                          n=i;      
                          for(k=0;k<=n;k++) sum+=k;
                          a[break_counter++]=sum;
                          sum=0;
                 }
                 if (break_counter==10) break;
    }
    for(i=0; i<=9; i++) printf("%d\n", a[i]);
    
    system("pause");
    return 0;
}
