/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери сумата от всички числа в интервала [0; 1000) делящи се на x и да се запише като първа стойност в масива. Да се намери сумата от всички числа в интервала [0;1000) деляща се на 2x и да се запише като втора стойност в масива. Аналогично да се намери сумата на всички числа делящи се на Nx за N в интервала [1;10] и да се запишат като елемент N-1 в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>

int main()
{
    int x, sum=0, a[10];
    int k, i;
    
    for(x=0; (x<=0)||(x>=10);) scanf("%d", &x);
    for(i=0;i<=9; i++)
    {
             for(k=0; k<=999; k++) if((float)k/((i+1)*x)-k/((i+1)*x)==0) sum+=k;
             a[i]=sum;
             sum=0;
    }
    for(i=0; i<=9; i++) printf("\n%d", a[i]);
    
    system("pause");
    return 0;
}
