/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото просто число в интервала [0; +?) завършващо на x и да се запише като първи елемент в масива. Да се намери второто просто число в интервала [0; +?) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0; +?) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>
#include<stdlib.h>

int main()
{
    int x, a[10];
    div_t divresult;
    int i,k,c=0,bool;
    
    for(x=0;(x<=0)||(x>=10);) scanf("%d", &x);
    for(i=0;;i++)
    {
                 bool=1;
                 for(k=2; k<7; k++)
                 {
                          if( (k==4) || (k==6) ) continue;
                          if( (i%k==0) && (i!=k) ) bool=0;
                 }        
                          if(bool==0) continue;

                          divresult=div(i,10);
                          if(divresult.rem==x) 
                          {
                           a[c]=i;
                           c++;
                          }
                 if(c>=10) break;
    }
    for(i=0; i<=9; i++) printf("%d\n", a[i]);
                          
    system("pause");
    return 0;
}                            
