/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<x<10. Да се инициализира масив от 10 елемента. Да се намери първото число на Фибоначи в интервала [0; +?) завършващо на x и да се запише като първи елемент в масива. Да се намери второто число на Фибоначи в интервала [0; +?) завършващо на x и да се запише като втори елемент в масива. Аналогично да се намерят първите N прости числа в интервала [0; +?) и да се запишат като елемент N в масива. Масивът да се изведе на стандартния изход.
*/

#include<stdio.h>
#include<stdlib.h>

int fib();

int main()
{
    int x, a[10];
    int *ptr;
    
    for(x=0; (x<=0)||(x>=10);) scanf("%d", &x);
    ptr = a;
    fib(1,0,ptr,0,x);
    for(x=0; x<=9; x++) printf("%d\n", a[x]);
    
    system("pause");
    return 0;
}
    
    
    
    
    
    
    
    
int fib(int num, int num_prev, int *a, int c, int x)
{
    div_t divresult;
    
    if(c==10) return 0;
    divresult = div(num,10);
    if(divresult.rem==x){
                         a[c]=num;
                         c++;
                         }
    return(fib(num+num_prev, num, a, c, x));
}
