/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където x e интервала [0; +?). Да се намерят първите 10 нечетни числа делители на x и да се запишат в масив. Масивът да се изведе на екрана и да се намерят простите числа в този масив.
*/

#include<stdio.h>
#include<stdlib.h>

int main()
{
    
    int x, a[10];
    int i,c=0;
    
    for(x=-1; x<0;) scanf("%d", &x);
    for(i=1;c<=9;i+=2) if(x%i==0) a[c++]=i;
    for(i=0; i<=9; i++) printf("%d\n", a[i]);
             
    system("pause");
    return 0;
}
