/*
#school - ТУЕС
#class - 11Б
#num - 19
#name - Йоан Методиев Марков
#task - Да се разработи програма, която изисква от потребителя да въведе целочислено число x, където 0<=x<10. Да се инициализира масив от 10 елемента. Да се намерят първите 10 стойности на функцията cos(x) в интервала [0; +?), в които третата цифра след десетичната запетая е x. Пример при cos(1) = 0.540302306 третата цифра след десетичната запетая е 0. При cos(2) = -0.416146837 третата цифра след десетичната запетая е 6. Намерените стойности да се зададат като стойности на елементите в масива. Елементите на масива да се изведат на стандартния изход.
*/

#include<stdio.h>
#include<stdlib.h>
#include<math.h>

int third(double input);

int main()
{
    int x;
    double a[10];
    int i, c=0;
    
    for(x=999; (x<0)||(x>=10);) scanf("%d", &x);
    for(i=0;;i++)
    {
                 if(c>9) break;
                 if(third(cos(i)) == x)
                 {
                                    a[c]=cos(i);
                                    c++;
                 }
    }
    for(i=0;i<=9;i++) printf("%f\n", a[i]);
    system("pause");
    return 0;
}

int third(double input)
{
    int work_num;
    
    input*=1000;
    work_num = (int)input;
    return work_num % 10;
}
